/*
Задача №8: Цикличный вывод данных на экран Задание
Необходимо с помощью цикла вывести на экран числа от 1 до 50.
 */
public class Task8 {
    public static void main(String args[]) {
        int i = 1;
        while (i < 51) {
            System.out.println(i);
            i++;
        }
    }


}
